from selenium.webdriver.common.by import By

# Локаторы на странице входа
# Кнопка Login
LOGIN_BUTTON = (By.ID, 'login-button')
# Поле для ввода логина
USER_NAME = (By.ID, 'user-name')
# Поле для ввода пароля
PASSWORD = (By.ID, 'password')
# Сообщение об ошибке при попытке входа с неправильными данными
ERROR_MESSAGE_CONTAINER = (By.ID, 'error-message-container')

# Локаторы на странице выбора товаров (страница, которая открывается сразу после входа)
# Кнопка для добавления в корзину портфеля
ADD_TO_CART_BACKPACK = (By.ID, 'add-to-cart-sauce-labs-backpack')
# Ссылка для перехода в корзину
SHOPPING_CART_LINK = (By.CLASS_NAME, 'shopping_cart_link')

# Локаторы на странице корзины
# Кнопка для перехода к первому шагу оформления заказа (заполнению данных)
CHECKOUT = (By.ID, 'checkout')
# Кнопка для удаления портфеля из корзины
REMOVE_BACKPACK = (By.ID, 'remove-sauce-labs-backpack')
# Товар в корзине (тут пишем общий локатор, а не только для портфеля,
# так как в практической работе №8 нужно будет убедиться, что в корзине нет товаров, то есть вообще нет никаких,
# а не только портфеля. Понятно, что добавляли мы только портфель, но проверка должна быть полной)
CART_ITEM = (By.CLASS_NAME, 'cart_item')
# Кнопка для возвращения на страницу выбора товаров из корзины
CONTINUE_SHOPPING = (By.ID, 'continue-shopping')

# Локаторы на странице первого шага оформления заказа (заполнение данных)
# Поле для ввода имени
FIRST_NAME = (By.ID, 'first-name')
# Поле для ввода фамилии
LAST_NAME = (By.ID, 'last-name')
# Поле для ввода ZIP/Postal Code
POSTAL_CODE = (By.ID, 'postal-code')
# Кнопка для перехода к второму шагу оформления заказа
CONTINUE = (By.ID, 'continue')

# Локаторы на странице второго шага оформления заказа (подтверждения заказа нажатием на кнопку Finish)
# Кнопка для подтверждения покупки
FINISH = (By.ID, 'finish')

#Локаторы на странице завершенного заказа (в практической работе №8 нужно будет проверить успешное завершение покупки,
# логика такая: если есть кнопка для генерации чека на покупку, то, следовательно, покупка успешно завершена,
# поэтому будем проверять наличие кнопки Generate PDF order, поэтому локатор пишем для нее)
# Кнопка для генерации pdf чека
GENERATE_PDF_ORDER = (By.CLASS_NAME, 'generate-pdf-order')